Revit 2027 API
AnalysisDisplayDeformedShapeSettings.IsEqual Method
 Compares two deformed shape settings objects.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	AnalysisDisplayDeformedShapeSettings other
)
Public Function IsEqual (
	other As AnalysisDisplayDeformedShapeSettings
) As Boolean
public:
bool IsEqual(
	AnalysisDisplayDeformedShapeSettings^ other
)
member IsEqual :
        other : AnalysisDisplayDeformedShapeSettings -> bool
Parameters
other AnalysisDisplayDeformedShapeSettings
 Deformed shape settings object to compare with.
Return Value
Boolean
 True if objects are equal, false otherwise.
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace